Tekla Open API Reference for Tekla Structures 2025
Symbol.Attributes Property
 Gets or sets the symbol attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Symbol.SymbolAttributes Attributes { get; set; }
Public Property Attributes As Symbol.SymbolAttributes
	Get
	Set
Property Value
Type: Symbol.SymbolAttributes
See Also
Reference
Symbol Class
Tekla.Structures.Drawing Namespace